[
    {
      "name": "Bharatiya Janata Party - BJP",
      "details": "The Bharatiya Janata Party is a political party in India The party's origins lie in the Bharatiya Jana Sangh, which was founded in 1951 by Indian politician Syama Prasad Mukherjee, after he left Hindu Mahasabha to form a party as the political wing of RSS.Since 2014, it has been the ruling political party in India under the incumbent Prime Minister Narendra Modi",
      "symbol": "/images/464px-Bharatiya_Janata_Party_(icon).svg.png"
    },
    {
      "name": "Indian National Congress - INC",
      "details": "The Indian National Congress (INC), colloquially the Congress Party or simply the Congress, is a political party in India with deep roots in most regions of India. Founded on 28 December 1885, it was the first modern nationalist movement to emerge in the British Empire in Asia and Africa.From the late 19th century, and especially after 1920, under the leadership of Mahatma Gandhi, the Congress became the principal leader of the Indian independence movement.[30] The Congress led India to independence from the United Kingdom and significantly influenced other anti-colonial nationalist movements in the British Empire",
      "symbol": "/images/480px-Indian_National_Congress_hand_logo.svg.webp"
    },
    {
      "name": "Samajwadi Party - SP",
      "details": "The Samajwadi Party (abbr. SP; lit.'Socialist Party') is a socialist political party in India. It was founded on 4 October 1992 by former Janata Dal politician Mulayam Singh Yadav and is headquartered in New Delhi. The Samajwadi Party is currently led by former Chief Minister of Uttar Pradesh, Akhilesh Yadav.It is currently third-largest party in Lok Sabha with 37 seats.",
      "symbol": "/images/471px-Samajwadi_Party.png"
    },
    {
      "name": "All India Trinamool Congress - AITC",
      "details": "The All India Trinamool Congress (All India Grassroots Congress; abbr. AITC) is an Indian political party that is mainly influential in the state of West Bengal.[19] It was founded by Mamata Banerjee on 1 January 1998 as a breakaway faction from the Indian National Congress and rapidly rose to prominence in the politics of West Bengal under her leadership. Presently, it is ruling the state of West Bengal beside being the fourth-largest party in India in terms of number of MPs just after the BJP and INC.",
      "symbol": "/images/All_India_Trinamool_Congress_symbol_2021.svg"
    },
    {
      "name": "Dravida Munnetra Kazhagam - DMK",
      "details": "The Dravida Munnetra Kazhagam (Tamil pronunciation: [t̪iɾaːʋiɖɐ munːeːtrɐk kɐɻɐɡɐm]; transl. Dravidian Progressive Federation;[10] abbr. DMK) is an Indian political party based in the state of Tamil Nadu, where it is currently the ruling party, and the union territory of Puducherry, where it is currently the main opposition.It is also one of the two main political parties in Tamil Nadu, along with the rival All India Anna Dravida Munnetra Kazhagam.[12] Since the 2021 state election, it has been the ruling party of Tamil Nadu. The DMK was founded on 17 September 1949 by the former chief minister of Tamil Nadu C. N. Annadurai (Anna) as a breakaway faction from the Dravidar Kazhagam headed by E. V. Ramasami (Periyar).",
      "symbol": "/images/partyC.png"
    },
    {
      "name": "Telugu Desam - TDP",
      "details": "The Telugu Desam Party (TDP; lit. 'Party of the Telugu Land')[14] is an Indian Telugu regionalist political party with influence in the states of Andhra Pradesh and Telangana.[15] It was founded by the former chief minister of Andhra Pradesh N. T. Rama Rao (N.T.R.) on 29 March 1982[16] and has focused on supporting Telugu speakers. The party has won a five-time majority in the Andhra Pradesh Legislative Assembly and has emerged as the most successful political outfit in the state's history. It is currently the ruling party in the Andhra Pradesh Legislative Assembly.From 1 September 1995, the TDP was led by N. T. Rama Rao's son-in-law and the former chief minister of Andhra Pradesh Nara Chandra Babu Naidu as national president of the party. The headquarters of the party is called N. T. R. Bhavan, which is located at Mangalagiri, Andhra Pradesh.",
      "symbol": "/images/Indian_Election_Symbol_Kite.svg"
    },
    {
      "name": "Janata Dal (United) - JD(U)",
      "details": "The All India Majlis-e-Ittehadul Muslimeen (transl. All India Council for Unity of Muslims; abbr. AIMIM) is an Indian political party based primarily in the old city of Hyderabad,[6] It is also a significant political party in the Indian States of Telangana , Maharashtra, Uttar Pradesh, Tamil Nadu and Bihar.AIMIM was originally founded as Majlis-e-Ittehadul Muslimeen (MIM) in 1927 by Nawab Mahmood Nawaz Khan Qiledar of Hyderabad State in the presence of Ulma-e-Mashaeqeen as a pro-partition partyAIMIM has held the Lok Sabha seat for the Hyderabad constituency since 1984. In the 2014 Telangana Legislative Assembly elections, the party won seven seats and received recognition as a state party by the Election Commission of India.People s Party (United) abbreviated as JD(U)  is an Indian political party with political presence mainly in eastern and north-eastern India.[4] JD(U) is recognised as a state party in the states of Bihar Arunachal Pradesh and Manipur and is a part of government in Bihar. JD(U) heads the government in Bihar and has remained the second largest party in Manipur.[5][6][7] JD(U) won 16 seats in the 2019 Indian general election  making it the seventh largest party in the Lok Sabha. JD(U) states that they believe in promoting social justice and lifting up marginalized peoples ",
      "symbol": "/images/Indian_Election_Symbol_Arrow.svg"
    },
    {
      "name": "Shiv Sena (Uddhav Balasaheb Thackrey) - SHSUBT",
      "details": "hiv Sena (Uddhav Balasaheb Thackeray) (IAST: Śhiva Sēnā (Ud'dhava bāḷāsāhēba ṭhākarē); lit. 'Army of Shivaji, led by Uddhav Balasaheb Thackeray'; abbr. SS (UBT))[10][11][12] is a Hindutva-based, Marathi regionalist,[13][6] nationalist political party formed in 2022 under the leadership of former Chief Minister of Maharashtra, Uddhav Thackeray",
      "symbol": "/images/partyC.png"
    },
    {
      "name": "Nationalist Congress Party – Sharadchandra Pawar - NCPSP",
      "details": "The Nationalist Congress Party is one of the state parties in India.[6][7] It refers to the Ajit Pawar faction after the 2023 split in the party when the Supreme Court of India granted the original party name and symbol to the Nationalist Congress Party (Ajit Pawar Faction). It was one of the major political parties in Maharashtra and was a recognised state party in Nagaland and Kerala. In July 2023, majority of the elected MLAs and MLCs of the party led by Ajit Pawar joined the National Democratic Alliance government, however, all MPs except two remained loyal to Sharad Pawar.[1][8] This caused a direct split between the Ajit Pawar-led faction and the founder and president Sharad Pawar who formed the Nationalist Congress Party (Sharadchandra Pawar) after EC recognised the Ajit Pawar faction as the original party.",
      "symbol": "/images/partyC.png"
    },
    {
      "name": "Shiv Sena - SHS",
      "details": "Shiv Sena (IAST: Śhiva Sēnā) (lit. 'Army of Shivaji') is a right-wing Marathi regionalist and Hindu ultranationalist political party in India founded in 1966 by Bal Thackeray.[16] Currently led by Eknath Shinde, this party is the ruling party of the Indian state of Maharashtra since 2019. Shiv Sena's election symbol is the Bow and Arrow. It uses the saffron colour in its flag and a image of a roaring tiger",
      "symbol": "/images/Indian_Election_Symbol_Bow_And_Arrow2.svg"
    },
    {
      "name": "Lok Janshakti Party(Ram Vilas) - LJPRV",
      "details": "The Lok Janshakti Party (Ram Vilas) (abbreviated as LJP (RV)) is an Indian political party formed in 2021 under the leadership of Chirag Paswan.[4] Election Commission of India froze the symbol of erstwhile main Lok Janshakti Party[5] and allotted new name and symbol to both factions.[6] It is now one of two separate factions - the other being the Rashtriya Lok Janshakti Party.[7]",
      "symbol": "/images/Indian_Election_Symbol_Helicopter.jpg"
    },
    {
      "name": "Yuvajana Sramika Rythu Congress Party - YSRCP",
      "details": "The Yuvajana Sramika Rythu Congress Party (lit. 'Youth, Labour, and Farmer Congress Party', YSRCP or YCP),[9] often shortened to simply the YSR Congress Party, is an Indian regional political party based in the state of Andhra Pradesh.[10] Its president, Y. S. Jagan Mohan Reddy,[11][12][13] has previously served as the state's chief minister. It currently has 4 seats in the Lok Sabha.",
      "symbol": "/images/640px-Indian_Election_Symbol_Ceiling_Fan.svg.png"
    },
    {
      "name": "Rashtriya Janata Dal - RJD",
      "details": "The Rashtriya Janata Dal (abbreviated as RJD; translation: National People's Party) is an Indian political party, based in the states of Bihar, Jharkhand and Kerala. The party was founded in 1997 by Lalu Prasad Yadav",
      "symbol": "/images/Indian_Election_Symbol_Hurricane_Lamp.png"
    },
    {
      "name": "Communist Party of India (Marxist) - CPI(M)",
      "details": "The Communist Party of India (Marxist) (abbreviated as CPI(M)) is a communist political party in India.[5] It is the largest communist party in India in terms of membership and electoral seats, and one of the national parties of India.[8] The party was founded through a splitting from the Communist Party of India in 1964 and it quickly became the dominant faction.",
      "symbol": "/images/CPI(M)_election_symbol_-_Hammer_Sickle_and_Star.svg"
    },
    {
      "name": "Indian Union Muslim League - IUML",
      "details": "Indian Union Muslim League (abbreviated as the IUML or Muslim League) is a political party primarily based in Kerala. It is recognised as a State Party in Kerala by the Election Commission of India.CAfter the Partition of India, the first Council of the Indian segment of the All-India Muslim League was held on 10 March 1948 at the south Indian city of Madras (now Chennai).[7] The party renamed itself as the 'Indian Union Muslim League' and adopted a new constitution on 1 September 1951",
      "symbol": "/images/408px-Indian_Election_Symbol_Lader.svg.png"
    },
    {
      "name": "Aam Aadmi Party - AAAP",
      "details": "The Aam Aadmi Party (transl. Common Man's Party; abbr. AAP) is a political party in India. It was founded on 26 November 2012 by Arvind Kejriwal and his then-companions,[23] following the 2011 Indian anti-corruption movement against then Indian government of Indian National Congress. AAP is currently the governing party in the Indian state of Punjab and the union territory of Delhi. On 10 April 2023, AAP was officially granted the status of National party by ECI.[24] The party's election symbol is a broom.[25] The party is currently part of the coalition I.N.D.I.A Alliance.",
      "symbol": "/images/640px-AAP_Symbol.png"
    },
    {
      "name": "Jharkhand Mukti Morcha - JMM",
      "details": "Jharkhand Mukti Morcha (lit. Jharkhand Liberation Front; abbr. JMM) is a political party in the Indian state of Jharkhand which was founded by Binod Bihari Mahato.[4] It has one seat in the 17th Lok Sabha. Shibu Soren is the president of the JMM. JMM is also an influential political party in the state of Odisha and parts of neighbouring of states. Its election symbol for Jharkhand is Bow and Arrow.",
      "symbol": "/images/Indian_Election_Symbol_Bow_And_Arrow.svg"
    },
    {
      "name": "Janasena Party - JnP",
      "details": "The Jana Sena Party (transl. People's Army Party; abbr. JSP) is an Indian regional political party in the states of Andhra Pradesh and Telangana. It was founded by Pawan Kalyan on 14 March 2014.[5][6] It is currently the second largest party in Andhra Pradesh Legislative Assembly and is a partner in the ruling coalition.[7] The party leader Pawan Kalyan serves as the deputy chief minister of Andhra Pradesh",
      "symbol": "/images/Indian_election_symbol_glass_tumbler.svg"
    },
    {
      "name": "Communist Party of India (Marxist-Leninist) (Liberation) - CPI(ML)(L)",
      "details": "The (CPI(ML)L) is a communist political party in India.[3] The party is represented in Bihar and Jharkhand Legislative Assemblies. Since 2023, the party is also a member of the INDIA electoral alliance.[4] In Bihar, party has significant base amongst the Extremely Backward Castes and the Scheduled Castes. It was successful in mobilising Upper Backward Caste groups such as Koeris in some districts of central Bihar, prior to the rise of Lalu Prasad Yadav. The party faced existential crisis when a large section of its Koeri and Yadav support base defected to Rashtriya Janata Dal in 1990s. However, the ideological commitment of its cadre protected it from disintegration.[5] It staged a comeback in politics after winning twelve seats in Bihar Legislative Assembly in 2020 and by sending two of its members to Lok Sabha in 2024 Indian general elections",
      "symbol": "/images/Flag_Logo_of_CPIML.png"
    },
    {
      "name": "Janata Dal (Secular) - JD(S)",
      "details": "The Janata Dal (Secular) (transl. People's Party (Secular); abbr. JD(S)) is an Indian regional political party[4] recognised as a state party in the Indian states of Karnataka, Kerala and Arunachal Pradesh. It was founded by the former prime minister of India H. D. Deve Gowda in July 1999 as a breakaway faction from the Janata Dal",
      "symbol": "/images/Indian_election_symbol_female_farmer.svg"
    },
    {
      "name": "Viduthalai Chiruthaigal Katchi - VCK",
      "details": "Viduthalai Chiruthaigal Katchi (transl. Liberation Panther Party; abbr. VCK), formerly known as the Dalit Panthers of India or the Dalit Panthers Iyyakkam (transl. Dalit Panthers Movement; abbr. DPI), is an Indian social movement and political party that seeks to combat caste based discrimination, active in the state of Tamil Nadu.[5] The party also has a strong emphasis on Tamil nationalism.[6][7] Its chairman is Thol. Thirumavalavan, a lawyer from Chennai, and its general secretary is the writer Ravikumar.",
      "symbol": "/images/Pot_Symbol.png"
    }
    ,
    {
      "name": "Communist Party of India - CPI",
      "details": "The Communist Party of India (CPI) is the oldest communist party in India. The CPI was founded in modern-day Kanpur on 26 December 1925.[",
      "symbol": "/images/CPI_symbol.svg"
    }
    ,
    {
      "name": "Rashtriya Lok Dal - RLD",
      "details": "Rashtriya Lok Dal (abbreviated as RLD) (translation: National People's Party) is an Indian regional political party in Uttar Pradesh and Rajasthan. It was founded by Chaudhary Ajit Singh, son of the former prime minister of India, Chaudhary Charan Singh in 1996 as a breakaway faction of the Janata Dal",
      "symbol": "/images/Indian_Election_Symbol_Hand_Pump.png"
    }
    ,
    {
      "name": "Jammu & Kashmir National Conference - JKN",
      "details": "The Jammu and Kashmir National Conference (JKNC) is a regional political party in Indian-administered Kashmir's union territories of Jammu and Kashmir and Ladakh. Founded as the All Jammu and Kashmir Muslim Conference by Sheikh Abdullah and Chaudhry Ghulam Abbas in 1932 in the princely state of Jammu and Kashmir, the organisation renamed itself to National Conference in 1939 in order to represent all the people of the state. It supported the accession of the princely state to India in 1947. Prior to that, in 1941, a group led by Ghulam Abbas broke off from the National Conference and revived the old Muslim Conference. The revived Muslim Conference supported the accession of the princely state to Pakistan and led the movement for Azad Kashmir",
      "symbol": "/images/Indian_Election_Symbol_Plough.png"
    }
    ,
    {
      "name": "United People’s Party, Liberal - UPPL",
      "details": "The United People's Party Liberal (abbr. UPPL) is a regional party of Assam. The party has its headquarters in Kokrajhar Town. The party has significant support in Bodoland Territorial Region.",
      "symbol": "/images/UPPL_symbol.jpg"
    }
    ,
    {
      "name": "Asom Gana Parishad - AGP",
      "details": "Asom Gana Parishad (translation: Assam People's Council, abbr. AGP) is a political party in the state of Assam, India. The AGP was formed following the historic Assam Accord of 1985[5] and formally launched at the Golaghat Convention held from 13 to 14 October 1985 in Golaghat,[6] which also allowed Prafulla Kumar Mahanta who was  the youngest chief minister of the state to be elected. The AGP has formed government twice once in 1985 then again in 1996. The popularity of AGP surged in the late 1980s but declined in the 2000s.[7] After a 20-year gap, AGP, in alliance with NDA, won a Lok Sabha seat in 2024.",
      "symbol": "/images/Indian_Election_Symbol_Elephant.png"
    }
    ,
    {
      "name": "Hindustani Awam Morcha (Secular) - HAMS",
      "details": "Hindustani Awam Morcha (Secular)[2] (English: Indian People's Front), abbreviated HAM(S), is an Indian political party with a presence in Bihar. In Bihar, this party is also a natural Allies of National Democratic Alliance (NDA) similar to Janata Dal (United). It received a new election symbol, the wok, for the Bihar Assembly election in 2020.",
      "symbol": "/images/Hindustani_Awam_Morcha_Secular.jpg"
    }
    ,
    {
      "name": "Kerala Congress - KEC",
      "details":"Kerala Congress is an Indian political party founded in Kottayam, Kerala in October 1964, by a block of former Indian National Congress leaders led by K. M. George.[3][4][5] The party is primarily active in central Kerala.[4][6] Initially its main support came from the Syrian Christians of central Kerala and the Nair community of southern Kerala. [7]",
      "symbol": "/images/640px-Auto_Rickshaw_Election_Symbol.svg.png"
    }
    ,
    {
      "name": "Revolutionary Socialist Party - RSP",
      "details": "Revolutionary Socialist Party (RSP) is a communist party in India. The party was founded on 19 March 1940 by Tridib Chaudhuri and has its roots in the Bengali liberation movement Anushilan Samiti and the Hindustan Socialist Republican Army.[",
      "symbol": "/images/Indian_Election_Symbol_Spade_and_Stoker.png"
    }
    ,
    {
      "name": "Nationalist Congress Party - NCP",
      "details": "The Nationalist Congress Party is one of the state parties in India.[6][7] It refers to the Ajit Pawar faction after the 2023 split in the party when the Supreme Court of India granted the original party name and symbol to the Nationalist Congress Party (Ajit Pawar Faction). It was one of the major political parties in Maharashtra and was a recognised state party in Nagaland and Kerala. In July 2023, majority of the elected MLAs and MLCs of the party led by Ajit Pawar joined the National Democratic Alliance government, however, all MPs except two remained loyal to Sharad Pawar.[1][8] This caused a direct split between the Ajit Pawar-led faction and the founder and president Sharad Pawar who formed the Nationalist Congress Party (Sharadchandra Pawar) after EC recognised the Ajit Pawar faction as the original party",
      "symbol": "/images/640px-Flag_of_Nationalist_Congress_Party.svg.png"
    }
    ,
    {
      "name": "Voice of the People Party - VOTPP",
      "details": "DThe Voice of the People Party is a political party established in November 2021 in the Indian state of Meghalaya.[1][2] The party president is Ardent Miller Basaiawmoit, who was elected to the Meghalaya Legislative assembly from Nongkrem constituency in the 2013 election[3][4] and again in the 2023 election.[5] The party contested 18 constituencies in the 2023 Meghalaya Legislative Assembly election and won 4 seats",
      "symbol": "/images/Winnower_Symbol.png"
    }
    ,
    {
      "name": "Zoram People’s Movement - ZPM",
      "details": "The Zoram People's Movement (abbreviated: ZPM) is an alliance of six regional parties formed under the leadership of MLA and former IPS Officer Lalduhoma.[3] The party advocates for secularism and the protection of religious minorities in India.[1] In the 2023 Mizoram Assembly polls, the party won 27 seats out of 40 seats and Lalduhoma became the Chief Minister of Mizoram",
      "symbol": "/images/ZPM_symbol.jpg"
    }
    ,
    {
      "name": "Shiromani Akali Dal - SAD",
      "details": "The Shiromani Akali Dal (SAD) (translation: Supreme Eternal Party[18]) is a centre-right Sikh-centric state political party in Punjab, India. The party is the second-oldest in India, after Congress, being founded in 1920.[19][20][21] Although there are many parties with the description Akali Dal, the party that is recognized as Shiromani Akali Dal by the Election Commission of India is the one led by Sukhbir Singh Badal. The party has a moderate Punjabi agenda.[22] On 26 September 2020, they left the NDA over the farm bills",
      "symbol": "/images/Shiromani_Akali_Dal_symbol.svg"
    }
    ,
    {
      "name": "Rashtriya Loktantrik Party - RLTP",
      "details": "DThe Rashtriya Loktantrik Party (RLP) is an Indian political party in the state of Rajasthan. The party was founded by Hanuman Beniwal on the eve of the 2018 Rajasthan Legislative Assembly elctionThe party entered into an alliance with the Bharatiya Janata Party on the eve of the 2019 Indian general election.[4] It has extended its support to the 2020 Bharat Bandh and the Indian farmers' protest",
      "symbol": "/images/Water_bottle_RLP_election_symbol.svg"
    }
    ,
    
    {
      "name": "Sikkim Krantikari Morcha - SKM",
      "details": "Sikkim Krantikari Morcha (translation: Sikkim Revolutionary Front) is a political party in the Indian state of Sikkim which is the ruling party of Sikkim since 2019.",
      "symbol": "/images/Symbol_SKM.png"
    }
    ,
    {
      "name": "Marumalarchi Dravida Munnetra Kazhagam - MDMK",
      "details": "The Marumalarchi Dravida Munnetra Kazhagam (transl. Renaissance Dravidian Progressive Federation; abbr. MDMK) is a political party active in the Indian state of Tamil Nadu. It was established by Vaiko in 1994 after he left the Dravida Munnetra Kazhagam. The headquarters of the party is called Thayagam, which is located at Rukmini Lakshmipathi Salai, Egmore, Chennai",
      "symbol": "/images/Indian_Election_Symbol_Matchbox.png"
    }
    ,
    {
      "name": "Aazad Samaj Party (Kanshi Ram) - ASPKR",
      "details": "The Azad Samaj Party's origins lie in the Bhim Army founded by Chandra Shekhar Aazad in 2015 to protect constitutional rights and oppose caste oppression.[5][6] The group formed after reports of discrimination and caste-based violence faced by Dalit students at AHP Inter-college in Uttar Pradesh, and the Bhim Army then helped protect the Dalit students.",
      "symbol": "/images/Azad_samaj_party_symbol.png"
    }
    ,
    {
      "name": "Apna Dal (Soneylal) - ADAL",
      "details": "The Apna Dal (Sonelal) is a breakaway party of Apna Dal which was founded in 1995 by Sone Lal Patel, Apna Dal (Sonelal) founded by Jawahar Lal Patel who was also founding member of Apna Dal and had the backing of Anupriya Patel.",
      "symbol": "/images/640px-Indian_Election_Symbol_Cup_and_Saucer.jpg"
    }
    ,
    {
      "name": "AJSU Party - AJSUP",
      "details": "All Jharkhand Students Union or AJSU PARTY is a state political party of Jharkhand state, India. AJSU PARTY was founded on June 22, 1986, modelled after All Assam Students Union. The founders of AJSU were disillusioned with the previous political parties of Jharkhand and wanted more militant agitations.",
      "symbol": "/images/590px-Indian_Election_Symbol_Banana.svg.png"
    }
    ,
    {
      "name": "All India Majlis-E-Ittehadul Muslimeen - AIMIM",
      "details": "The All India Majlis-e-Ittehadul Muslimeen (transl. All India Council for Unity of Muslims; abbr. AIMIM) is an Indian political party based primarily in the old city of Hyderabad,[6] It is also a significant political party in the Indian States of Telangana , Maharashtra, Uttar Pradesh, Tamil Nadu and Bihar.AIMIM was originally founded as Majlis-e-Ittehadul Muslimeen (MIM) in 1927 by Nawab Mahmood Nawaz Khan Qiledar of Hyderabad State in the presence of Ulma-e-Mashaeqeen as a pro-partition partyAIMIM has held the Lok Sabha seat for the Hyderabad constituency since 1984. In the 2014 Telangana Legislative Assembly elections, the party won seven seats and received recognition as a state party by the Election Commission of India.",
      "symbol": "/images/Indian_Election_Symbol_Kite.svg"
    }
    
  ]
  